Reports/бит_СписокПеременившихФамилию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>бит_СписокПеременившихФамилию</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_АдминистративныеОкруга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/бит_ФИОПроживающих.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ФИОПроживающих</Name>
			<Comment>БИТ</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/бит_ВариантыИзмененияМестаПребывания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ВариантыИзмененияМестаПребывания</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВТомЖеГородеСДругогоАдреса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СДругогоГорода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СменаПаспорта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СменаФамилии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДругаяПричина</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/бит_СписокПеременившихФамилию/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ФормированиеОтчета
	
// Выполняет запрос и формирует табличный документ-результат отчета.
// В соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом.
//	ПоказыватьЗаголовок - признак видимости строк с заголовком отчета.
//	ВысотаЗаголовка - параметр, через который возвращается высота заголовка в строках. 
//  ДокументОбъект - если указан, то печать отчета по документу.
//
Процедура СформироватьОтчет(Знач ПараметрыОтчета, АдресХранилища) Экспорт
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	ДокументРезультат.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ДокументРезультат.АвтоМасштаб			= Истина;
	
	Макет = Отчеты.бит_СписокПеременившихФамилию.ПолучитьМакет("Макет");
	
	ОбластьШапка        = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока       = Макет.ПолучитьОбласть("Строка");
	ОбластьПустаяСтрока = Макет.ПолучитьОбласть("ПустаяСтрока");
	ОбластьПодвал       = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьШапка.Параметры.НачалоПериода = Формат(ПараметрыОтчета.НачалоПериода, "ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.КонецПериода  = Формат(ПараметрыОтчета.КонецПериода , "ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.Район         = ПараметрыОтчета.Район;
	
	ДокументРезультат.Вывести(ОбластьШапка);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода",ПараметрыОтчета.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода" ,ПараметрыОтчета.КонецПериода);
	Запрос.УстановитьПараметр("Район"        ,ПараметрыОтчета.Район);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.РегистрируемоеЛицо КАК РегистрируемоеЛицо,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.Дата КАК Дата,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет
	|ПОМЕСТИТЬ Заявление
	|ИЗ
	|	Документ.бит_ЗаявлениеОРегистрацииПоМестуПЖ КАК бит_ЗаявлениеОРегистрацииПоМестуПЖ
	|ГДЕ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖ.ОткудаПрибыл = ЗНАЧЕНИЕ(Перечисление.бит_ВариантыИзмененияМестаПребывания.СменаФамилии)
	|	И бит_ЗаявлениеОРегистрацииПоМестуПЖ.ЛицевойСчет.Здание.Район = &Район
	|	И бит_ЗаявлениеОРегистрацииПоМестуПЖ.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Дата,
	|	РегистрируемоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Заявление.РегистрируемоеЛицо КАК РегистрируемоеЛицо,
	|	Заявление.Дата КАК Дата,
	|	МАКСИМУМ(бит_ФИОПроживающих.Период) КАК Период,
	|	Заявление.ЛицевойСчет
	|ПОМЕСТИТЬ МаксФИО
	|ИЗ
	|	Заявление КАК Заявление
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих КАК бит_ФИОПроживающих
	|		ПО Заявление.РегистрируемоеЛицо = бит_ФИОПроживающих.ФизЛицо
	|			И Заявление.Дата >= бит_ФИОПроживающих.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	Заявление.Дата,
	|	Заявление.РегистрируемоеЛицо,
	|	Заявление.ЛицевойСчет
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РегистрируемоеЛицо,
	|	Дата,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Заявление.РегистрируемоеЛицо КАК РегистрируемоеЛицо,
	|	Заявление.Дата КАК Дата,
	|	МАКСИМУМ(бит_ФИОПроживающихДо.Период) КАК Период
	|ПОМЕСТИТЬ МаксФИОДо
	|ИЗ
	|	Заявление КАК Заявление
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих КАК бит_ФИОПроживающихДо
	|		ПО Заявление.РегистрируемоеЛицо = бит_ФИОПроживающихДо.ФизЛицо
	|			И (ДОБАВИТЬКДАТЕ(Заявление.Дата, ДЕНЬ, -1) >= бит_ФИОПроживающихДо.Период)
	|
	|СГРУППИРОВАТЬ ПО
	|	Заявление.Дата,
	|	Заявление.РегистрируемоеЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РегистрируемоеЛицо,
	|	Дата,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксФИО.РегистрируемоеЛицо КАК РегистрируемоеЛицо,
	|	МаксФИО.Дата КАК Дата,
	|	бит_ФИОПроживающих.Фамилия,
	|	бит_ФИОПроживающих.Имя,
	|	бит_ФИОПроживающих.Отчество,
	|	МаксФИО.ЛицевойСчет
	|ПОМЕСТИТЬ ФИО_До
	|ИЗ
	|	МаксФИО КАК МаксФИО
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих КАК бит_ФИОПроживающих
	|		ПО МаксФИО.РегистрируемоеЛицо = бит_ФИОПроживающих.ФизЛицо
	|			И МаксФИО.Период = бит_ФИОПроживающих.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РегистрируемоеЛицо,
	|	Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксФИОДо.РегистрируемоеЛицо КАК РегистрируемоеЛицо,
	|	МаксФИОДо.Дата КАК Дата,
	|	бит_ФИОПроживающих.Фамилия,
	|	бит_ФИОПроживающих.Имя,
	|	бит_ФИОПроживающих.Отчество
	|ПОМЕСТИТЬ ФИО_После
	|ИЗ
	|	МаксФИОДо КАК МаксФИОДо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих КАК бит_ФИОПроживающих
	|		ПО МаксФИОДо.РегистрируемоеЛицо = бит_ФИОПроживающих.ФизЛицо
	|			И МаксФИОДо.Период = бит_ФИОПроживающих.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РегистрируемоеЛицо,
	|	Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФИО_До.РегистрируемоеЛицо КАК РегистрируемоеЛицо,
	|	ФИО_До.Дата КАК Дата,
	|	ФИО_До.Фамилия,
	|	ФИО_До.Имя,
	|	ФИО_До.Отчество,
	|	ФИО_После.Фамилия КАК ФамилияС,
	|	ФИО_После.Имя КАК ИмяС,
	|	ФИО_После.Отчество КАК ОтчествоС,
	|	ФИО_До.РегистрируемоеЛицо.ДатаРождения КАК ДатаРождения,
	|	ПОДСТРОКА(ФИО_До.ЛицевойСчет.Здание.ПочтовыйАдрес, 1, 999) + "", кв. "" + ПОДСТРОКА(ФИО_До.ЛицевойСчет.Квартира.Наименование, 1, 50) КАК Адрес
	|ИЗ
	|	ФИО_До КАК ФИО_До
	|		ЛЕВОЕ СОЕДИНЕНИЕ ФИО_После КАК ФИО_После
	|		ПО ФИО_До.РегистрируемоеЛицо = ФИО_После.РегистрируемоеЛицо
	|			И ФИО_До.Дата = ФИО_После.Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	РегистрируемоеЛицо,
	|	Дата УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Заявление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ МаксФИО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ МаксФИОДо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ФИО_До
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ФИО_После";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Количество  = Выборка.Количество();
	НомерСтроки = 0;
	
	Пока Выборка.Следующий() Цикл
		
		НомерСтроки = НомерСтроки + 1;
		
		ФИО  = Выборка.Фамилия  + " " + Выборка.Имя  + " " + Выборка.Отчество;
		ФИОс = Выборка.ФамилияС + " " + Выборка.ИмяС + " " + Выборка.ОтчествоС + " / " + Формат(Выборка.Дата, "ДФ=dd.MM.yyyy");
		
		ОбластьСтрока.Параметры.ФИО          = ФИО;
		ОбластьСтрока.Параметры.ФИОс         = ФИОс;
		ОбластьСтрока.Параметры.ДатаРождения = Формат(Выборка.ДатаРождения, "ДФ=dd.MM.yyyy");
		ОбластьСтрока.Параметры.Адрес        = Выборка.Адрес;
		
		ДокументРезультат.Вывести(ОбластьСтрока);
		
		Если НЕ НомерСтроки = Количество Тогда
			ДокументРезультат.Вывести(ОбластьПустаяСтрока);
		КонецЕсли; 
		
	КонецЦикла; 
	
	ДокументРезультат.Вывести(ОбластьПодвал);
	
	ПоместитьВоВременноеХранилище(ДокументРезультат, АдресХранилища);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
